{
  "rss": {
    "@attributes": {
      "version": "2.0"
    },
    "channel": {
      "title": "Buyee Blog",
      "link": "https:\/\/blog.buyee.jp",
      "description": "FIND ALL KINDS OF YOUR DESIRED JAPANESE PRODUCTS HERE!",
      "lastBuildDate": "Fri, 03 Sep 2021 09:25:11 +0000",
      "language": "en-US",
      "generator": "https:\/\/wordpress.org\/?v=5.8.2",
      "item": [
        {
          "title": "Board Gamer",
          "link": "https:\/\/blog.buyee.jp\/boadgamer\/",
          "pubDate": "Thu, 02 Sep 2021 10:22:28 +0000",
          "category": "Toy & Hobby",
          "guid": "https:\/\/blog.buyee.jp\/?p=8928",
          "description": "Here is an introduction to the latest popular Japanese stores. Learn about a wide range of products, including rare goods and great deals that can only be obtained from these Japanese stores. Products Store Introduction Board Gamer A board game specialty store created to let many people know the fun and charm of board games."
        },
        {
          "title": "7 Most Expensive and Rare Pokemon Cards Sold at Japanese Auction With Buyee",
          "link": "https:\/\/blog.buyee.jp\/pokemon-expensive-rare-cards-2\/",
          "pubDate": "Thu, 26 Aug 2021 06:41:43 +0000",
          "category": "Toy & Hobby",
          "guid": "https:\/\/blog.buyee.jp\/?p=8800",
          "description": "The first series of the Pokemon TCG (Trading Card Game) franchise was released in Japan in October 1996. Pokemon TCG cards are popular in the world of competitive card games, with many promotional events and tournaments held, and as a collectible fad, with many fans trying to &#8220;collect &#8217;em all&#8221;. In recent years, there has [&#8230;]"
        },
        {
          "title": "Get Exercising with Nintendo Switch! 5 Trending Japanese Indoor Exercise Games",
          "link": "https:\/\/blog.buyee.jp\/ns-exercise-2\/",
          "pubDate": "Wed, 14 Jul 2021 02:01:38 +0000",
          "category": "Toy & Hobby",
          "guid": "https:\/\/blog.buyee.jp\/?p=8643",
          "description": "When doing exercises to achieve long-term weight loss, in addition to the time required to see any benefits, a certain degree of endurance is also required. This endurance requires strong motivation, and video games on systems such as the Nintendo Switch have been shown to provide the best kind of motivation for anyone who wants [&#8230;]"
        },
        {
          "title": "The Top 5 Shockingly Expensive TCG Cards!",
          "link": "https:\/\/blog.buyee.jp\/theme-tradingcard-20200622-2\/",
          "pubDate": "Wed, 24 Jun 2020 02:56:15 +0000",
          "category": "Toy & Hobby",
          "guid": "https:\/\/blog.buyee.jp\/?p=7349",
          "description": "Have you ever played any trading card game series, such as Yu-Gi-Oh! or the always popular Pokemon trading card game? As fans of these trading card game series will know, over the years some cards have become very rare and hard to obtain. The most serious collectors of trading cards will want to buy these [&#8230;]"
        },
        {
          "title": "The 50 Billionth Year Anniversary of Tomica’s Collectible Cars!",
          "link": "https:\/\/blog.buyee.jp\/theme-tomica-20200511-2\/",
          "pubDate": "Thu, 07 May 2020 03:37:53 +0000",
          "category": "Toy & Hobby",
          "guid": "https:\/\/blog.buyee.jp\/?p=7119",
          "description": "Recently, Tomica&#8217;s &#8217;50 Billionth Year Anniversary&#8217; has become a trending topic on Japanese Twitter. You may be wondering, &#8216;Why 50 Billion?&#8217; In reality, it is Tomica&#8217;s 50th anniversary this year, and this new &#8217;50 Billionth Year Anniversary&#8217; is just one part of this big new celebration, complete with special limited edition content and products. A [&#8230;]"
        },
        {
          "title": "Worldwide famous Nissan cars! 50th Anniversary of GT-R and Fairlady Z!",
          "link": "https:\/\/blog.buyee.jp\/jppost20191030-cars-3\/",
          "pubDate": "Thu, 07 Nov 2019 09:19:18 +0000",
          "category": [
            "Recommended",
            "Toy & Hobby"
          ],
          "guid": "https:\/\/blog.buyee.jp\/?p=6511",
          "description": "Anniversary Special items! Nissan GT-R and Fairlady Z unveiled from 1969 and here comes its 50th anniversary! Speak of the 2 cars, most of us must think of famous animation &#8220;Initial D&#8221; and blockbuster series &#8220;Fast &#38; Furious&#8221;! And the items released this time will drive every fan crazy! Except for ordinary goods like tumbler [&#8230;]"
        },
        {
          "title": "Omamori for the best seats at a concert! TOWER RECORD original merch for fans!",
          "link": "https:\/\/blog.buyee.jp\/towerrecord-191911\/",
          "pubDate": "Wed, 25 Sep 2019 07:51:23 +0000",
          "category": "Toy & Hobby",
          "guid": "https:\/\/blog.buyee.jp\/?p=6402",
          "description": "In order to see the concert of your favorite idol, are you in the war of getting a ticket? TOWER RECORD, which is a famous shop in Japan selling numerous music-related items such as CDs, photo books, etc. As know the most of how hard as being a fangirl\/fanboy, they would like to support your [&#8230;]"
        },
        {
          "title": "Stop playing UNO in your group! 3 games you should try in your next family game night!",
          "link": "https:\/\/blog.buyee.jp\/boardgamer02-190815-2\/",
          "pubDate": "Wed, 04 Sep 2019 07:38:52 +0000",
          "category": "Toy & Hobby",
          "guid": "https:\/\/blog.buyee.jp\/?p=6274",
          "description": "Always concerning what to play when hanging out with friends or family? Especially when there are quite many people in the party! Today I would like to introduce 3 board game to you, and hope will give you some new idea! 【Topology Memory】Crazy Slapjack！Not only have to move fast, also have to think fast! 【Coyote】adorable [&#8230;]"
        },
        {
          "title": "For tabletop gamer – Japanese board games recommendation!",
          "link": "https:\/\/blog.buyee.jp\/boardgamer01-190820\/",
          "pubDate": "Wed, 04 Sep 2019 07:38:47 +0000",
          "category": "Toy & Hobby",
          "guid": "https:\/\/blog.buyee.jp\/?p=6287",
          "description": "Speak of board games, usually, games such as Monopoly, Scrabble, and Risk might come into our mind. However, there are much more kinds of board games than you think! Today I would like to introduce 4 simple games designed in Japan to a hardcore tabletop gamer who want to try something new! Board games made [&#8230;]"
        },
        {
          "title": "[Limited Time Offer] SNK ONLINE SHOP ★SUMMER SALE 2019★",
          "link": "https:\/\/blog.buyee.jp\/snksummersale190730-2\/",
          "pubDate": "Thu, 01 Aug 2019 10:23:43 +0000",
          "category": "Toy & Hobby",
          "guid": "https:\/\/blog.buyee.jp\/?p=6227",
          "description": "The classic blade-wielding fighting game series SAMURAI SHODOWN has made its comeback with brand new game in June, 2019. And this August, SAMURAI SHODOWN will take the main stage at EVO 2019, the largest and longest-running fighting game tournament in the world! To celebrate it, SNK offers a special summer sale at their SNK official [&#8230;]"
        }
      ]
    }
  }
}